/***Завдання:**
1. Створення проекту: Ініціалізуйте новий проект та налаштуйте середовище для роботи з Jest. 
Для цього вам знадобиться створити новий каталог для проекту, ініціалізувати npm (`npm init -y`), встановити Jest як залежність розробки (`npm install --save-dev jest`) та додати в `package.json` скрипт для запуску тестів: `"test": "jest"`.
2. Тестування функції `ageClassification(num)`:** Ваше завдання полягає у написанні тестів для функції `ageClassification(num)`, яка класифікує вік людини. 
Тест повинен перевірити коректність роботи функції для всіх вказаних у прикладі діапазонів віку.*/

function ageClassification(num) {
    return num < 0 ? null :
    num <= 24 ? 'Дитинство' :
    num <= 44 ? 'Молодість' :
        num <= 65 ? 'Зрілість' :
        num <= 75 ? 'Старість' :
            num <= 90 ? 'Довголіття' :
            num <= 122 ? 'Рекорд' : null
}

module.exports = {
    ageClassification
}